InformationRegisters/Б24_СУ_ТаблицаИзменений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Б24_СУ_ТаблицаИзменений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяЗаписиВМиллисекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Б24_К_НастройкиПодключения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Б24_К_ТипыДанныхДляОбменаСПорталом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодчиненныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Б24_СУ_ТаблицаИзменений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ДобавитьОбъектВТаблицуИзменений(НастройкаПодключения, ТипДанныхДляРегистрацииИзменений, Ключ, Объект, ПодчиненныйОбъект = Неопределено, ВремяЗаписиВМиллисекундах = Неопределено) Экспорт
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("НастройкаПодключения"	, НастройкаПодключения);
	СтруктураОтбора.Вставить("ТипДанных"				, ТипДанныхДляРегистрацииИзменений);
	СтруктураОтбора.Вставить("Ключ"					, Ключ);
	СтруктураОтбора.Вставить("Объект"					, Объект);
	СтруктураОтбора.Вставить("ПодчиненныйОбъект"		, ПодчиненныйОбъект);
	
	Если РегистрыСведений.Б24_СУ_ТаблицаИзменений.Получить(СтруктураОтбора).ВремяЗаписиВМиллисекундах = 0 Тогда 
		Если ЗначениеЗаполнено(Объект) ИЛИ ЗначениеЗаполнено(ПодчиненныйОбъект) Тогда
			
			НоваяЗапись = РегистрыСведений.Б24_СУ_ТаблицаИзменений.СоздатьМенеджерЗаписи();  
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураОтбора);
			НоваяЗапись.ВремяЗаписиВМиллисекундах	= ?(ВремяЗаписиВМиллисекундах = Неопределено, ТекущаяУниверсальнаяДатаВМиллисекундах(), ВремяЗаписиВМиллисекундах);
			НоваяЗапись.Записать();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция НаличиеИзмененийПоТипуДанных(НастройкаПодключения, ТипДанных) Экспорт
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("НастройкаПодключения", НастройкаПодключения);
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_СУ_ТаблицаИзменений.НастройкаПодключения КАК НастройкаПодключения,
	|	Б24_СУ_ТаблицаИзменений.ТипДанных КАК ТипДанных,
	|	Б24_СУ_ТаблицаИзменений.Ключ КАК Ключ,
	|	Б24_СУ_ТаблицаИзменений.Объект КАК Объект,
	|	Б24_СУ_ТаблицаИзменений.ПодчиненныйОбъект КАК ПодчиненныйОбъект,
	|	Б24_СУ_ТаблицаИзменений.ВремяЗаписиВМиллисекундах КАК ВремяЗаписиВМиллисекундах
	|ИЗ
	|	РегистрСведений.Б24_СУ_ТаблицаИзменений КАК Б24_СУ_ТаблицаИзменений
	|ГДЕ
	|	Б24_СУ_ТаблицаИзменений.НастройкаПодключения = &НастройкаПодключения
	|	И Б24_СУ_ТаблицаИзменений.ТипДанных = &ТипДанных";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецЕсли
